---
layout: post
title: PHPText — простая локализация
date: 2010-11-13 17:20
---
Для локализации программ существует много решений и конечно же gettext. Однако объяснить рядовому пользователю windows, как при помощи его перевести программу, составляет большую трудность.
    <br>
    Поэтому я решил написать небольшое приложение для простой локализации.<br>
<br>
    <img class="center-image"  src="http://habrastorage.org/storage/habraeffect/b5/a9/b5a9b9655c20ca0c77ceb194e15e0696.png"><br>
<!--more-->
    <br>
    Написано оно на C# и умеет при помощи Google Translate переводить сообщения. Так же оно может работать с уже готовым словарем.
    <br>
    Для хранения словарей я выбрал самый простой формат:<br>
    <pre><code data-language="php">&lt;?php
$_LANG = array(
    &#039;id&#039; =&gt; &#039;text&#039;
        );</code></pre>    <br>
    В коде вместо стандартной <b>_(...)</b>, я решил использовать
    <b>tr(...)</b> (как в Qt), так как иначе будут проблемы с тему у кого <i>GetText Support:
    enabled</i>. В программе название функции можно заменить в настройках.<br>
    <br>
    После выбора каталога с исходниками, программа собирает все вхождения
    <b>tr|_(...)</b> в php файлах и добавляет их в таблицу. Каждой строке присваивается статус (столбец New):<br>
    <ul>
        <li><img src="http://habrastorage.org/storage/habraeffect/b1/07/b107d3f96730f1d833f3fe95718d1a21.png"> —
            сообщение присутствует в исходнике и словаре.
        </li>
        <li><img src="http://habrastorage.org/storage/habraeffect/74/dd/74ddd91d0284629b633d0990a55c683b.png"> —
            сообщение присутствует в словаре, но в исходниках не обнаружено.
        </li>
        <li><img src="http://habrastorage.org/storage/habraeffect/3c/54/3c54d576056a91fea1b044e6dde634c5.png"> — новое
            сообщение. Присутствует только в исходнике.
        </li>
    </ul><br>
    <br>
    Ненужные более сообщения можно удалить. Новые перевести при помощи гугла и что-то подредактировать самостоятельно.
    <br>
    <br>
    Свой проект, я смог перевести за 20 минут. Надеюсь что моё приложение пригодится кому-нибудь ещё.<br>
    <br>
    PHPText на <a href="http://code.google.com/p/phptext/">Google Code</a>: <a href="http://phptext.googlecode.com/files/PHPText.exe">Скачать</a>
    <br>
    <br>
